# -*- coding: utf-8 -*-
"""
Created on Mon Aug 11 15:53:27 2025

@author: hirar
"""

#======================================================================================================================================
#            グローバル変数
#======================================================================================================================================
VERSION = "3.0"                         #バージョン
LINE_MARGE_NORM_MN = 1                  #単位:mm ラインを結合時にラインを結合してよいかを判断するためのライン端点間距離
N_FILLET_INTERPORATE = 10               #オフセットした線間を補完するフィレットの座標点数
ERROR_LOG_FILENAME = "error_log.txt"    #エラーログを出力するファイル名
DIST_NEAR = 0.0001                      #近傍点判定距離[mm]
AUTOSORT_WHEN_LOADFILE = False          #dxfファイルオープン時に自動ソートする